In [1]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Creating path
path = r'C:\Users\13472\Documents\05-2023 Instacart Basket Analysis- UE'

# Step 3

In [3]:
# Importing analysis libraries
df_cust = pd.read_csv(os.path.join(path, '02. Data', 'Original Data', 'customers.csv'))

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_cust.shape

(206209, 10)

# Step 4

In [6]:
# Dropping names within df
df_cust = df_cust.drop(columns = ['First Name','Surnam'])

In [7]:
df_cust.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Renaming Columns
df_cust.rename(columns = {'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'number_of_dependants', 'fam_status' : 'family_status'}, inplace = True)

In [9]:
df_cust.head()

,user_id,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
#Variable types
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   gender                206209 non-null  object
 2   state                 206209 non-null  object
 3   age                   206209 non-null  int64
 4   date_joined           206209 non-null  object
 5   number_of_dependants  206209 non-null  int64
 6   family_status         206209 non-null  object
 7   income                206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

In [11]:
df_cust.dtypes

user_id                  int64
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [12]:
#Changing user id to string
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [13]:
# Importing orders_products_agg df

ords_prods_agg = pd.read_pickle(os.path.join(path, '02. Data', 'Prepared Data', 'orders_products_agg.pkl'))

In [14]:
ords_prods_agg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                         Dtype
---  ------                         -----
 0   Unnamed: 0.1                   int64
 1   order_id                       int64
 2   user_id                        int64
 3   order_number                   int64
 4   orders_day_of_week             int64
 5   orders_hod                     int64
 6   days_since_prior_order         float64
 7   product_id                     int64
 8   add_to_cart_order              int64
 9   reordered                      int64
 10  product_name                   object
 11  aisle_id                       int64
 12  department_id                  int64
 13  prices                         float64
 14  _merge                         category
 15  price_range_loc                object
 16  busiest_day                    object
 17  busiest_days                   object
 18  busiest_period_of_day          object
 19  max_order                      int64
 20  loyalty_flag                   object
 21  avg_price                      float64
 22  spending_flag                  object
 23  median_days_since_prior_order  float64
 24  order_frequency_flag           object
dtypes: category(1), float64(4), int64(12), object(8)
memory usage: 6.1+ GB

No Need to change variable types

In [15]:
#Changing user id to string
ords_prods_agg['user_id'] = ords_prods_agg['user_id'].astype('str')

In [16]:
## downcasting loop
for column in ords_prods_agg:
 if ords_prods_agg[column].dtype == 'float32': ords_prods_agg[column]=pd.to_numeric(ords_prods_agg[column], downcast='float') 
if ords_prods_agg[column].dtype == 'int64': ords_prods_agg[column]=pd.to_numeric(all_data[column], downcast='integer')

In [17]:
ords_prods_agg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                         Dtype
---  ------                         -----
 0   Unnamed: 0.1                   int64
 1   order_id                       int64
 2   user_id                        object
 3   order_number                   int64
 4   orders_day_of_week             int64
 5   orders_hod                     int64
 6   days_since_prior_order         float64
 7   product_id                     int64
 8   add_to_cart_order              int64
 9   reordered                      int64
 10  product_name                   object
 11  aisle_id                       int64
 12  department_id                  int64
 13  prices                         float64
 14  _merge                         category
 15  price_range_loc                object
 16  busiest_day                    object
 17  busiest_days                   object
 18  busiest_period_of_day          object
 19  max_order                      int64
 20  loyalty_flag                   object
 21  avg_price                      float64
 22  spending_flag                  object
 23  median_days_since_prior_order  float64
 24  order_frequency_flag           object
dtypes: category(1), float64(4), int64(11), object(9)
memory usage: 6.1+ GB

# Step 5

In [18]:
# Checking for any missing values
df_cust.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

As you can see above there are no missing values

In [19]:
# Checking for duplicates
df_dups = df_cust[df_cust.duplicated()]

In [20]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

There are no duplicates

In [21]:
# Checking for mixed data
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

There is no mixed data

# Step 6

In [22]:
# Checking shape of df
df_cust.shape

(206209, 8)

In [23]:
ords_prods_agg.shape

(32404859, 25)

In [24]:
ords_prods_agg.head()

,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,orders_hod,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_days_since_prior_order,order_frequency_flag
0,0,2539329,1,1,2,8,NaN,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,1,2398795,1,2,3,7,15.0,196,1,1,...,Mid-range product,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2,473747,1,3,3,12,21.0,196,1,1,...,Mid-range product,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,3,2254736,1,4,4,7,29.0,196,1,1,...,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,4,431534,1,5,4,15,28.0,196,1,1,...,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [25]:
# Dropping unnamed column
ords_prods_agg = ords_prods_agg.drop(columns = ['Unnamed: 0.1'] )

In [26]:
ords_prods_agg = ords_prods_agg.drop(columns = ['_merge'])

In [27]:
ords_prods_agg.shape

(32404859, 23)

In [28]:
ords_prods_agg.head()

,order_id,user_id,order_number,orders_day_of_week,orders_hod,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_days_since_prior_order,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [29]:
# Checking max price
ords_prods_agg['prices'].max()

99999.0

Since this is not possible, I will be replaces all values over $100 with Nan

In [30]:
ords_prods_agg.loc[ords_prods_agg['prices'] >100, 'prices'] = np.nan

In [31]:
ords_prods_agg['prices'].max()

25.0

In [32]:
#Merging Dataframes
df_comb = ords_prods_agg.merge(df_cust, on = 'user_id')

In [34]:
df_comb.shape

(32404859, 30)

In [35]:
df_comb.head()

,order_id,user_id,order_number,orders_day_of_week,orders_hod,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,spending_flag,median_days_since_prior_order,order_frequency_flag,gender,state,age,date_joined,number_of_dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [36]:
df_comb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        object
 2   order_number                   int64
 3   orders_day_of_week             int64
 4   orders_hod                     int64
 5   days_since_prior_order         float64
 6   product_id                     int64
 7   add_to_cart_order              int64
 8   reordered                      int64
 9   product_name                   object
 10  aisle_id                       int64
 11  department_id                  int64
 12  prices                         float64
 13  price_range_loc                object
 14  busiest_day                    object
 15  busiest_days                   object
 16  busiest_period_of_day          object
 17  max_order                      int64
 18  loyalty_flag                   object
 19  avg_price                      float64
 20  spending_flag                  object
 21  median_days_since_prior_order  float64
 22  order_frequency_flag           object
 23  gender                         object
 24  state                          object
 25  age                            int64
 26  date_joined                    object
 27  number_of_dependants           int64
 28  family_status                  object
 29  income                         int64
dtypes: float64(4), int64(13), object(13)
memory usage: 7.5+ GB

# Exporting Dataframes

In [37]:
df_comb.to_pickle(os.path.join(path, '02. Data','Prepared Data', 'orders_products_all.pkl'))